Terraform Plan:
```aws_vpc.main: Refreshing state... [id=vpc-03e05ec4d7ef91467]
aws_eip.nat_eip: Refreshing state... [id=eipalloc-013904bf197fc22ee]
aws_ebs_volume.gp3_volume_prometheus: Refreshing state... [id=vol-099aaae27ba9c2e1d]
aws_route53_zone.apse2-name: Refreshing state... [id=Z09894843QG7J1MO45IQ0]
aws_cloudwatch_log_group.ecs_log_group: Refreshing state... [id=/ecs/siem]
aws_acm_certificate.apse2_wildcard_cert: Refreshing state... [id=arn:aws:acm:us-east-1:941133421128:certificate/e644724a-c055-4c6d-8d92-29b35864782d]
aws_ebs_volume.gp3_volume_grafana: Refreshing state... [id=vol-046731b68b9381cc7]
aws_iam_role.ec2_instance_role: Refreshing state... [id=ec2-instance-role-generic]
aws_ebs_volume.gp3_volume_wazuh-indexer: Refreshing state... [id=vol-0fef670bbba91e14b]
aws_iam_role_policy_attachment.cloudwatch_agent_server_policy: Refreshing state... [id=ec2-instance-role-generic-20240126004538603800000002]
aws_iam_role_policy_attachment.ssm_managed_instance_core: Refreshing state... [id=ec2-instance-role-generic-20240126004538591100000001]
aws_iam_instance_profile.ec2_instance_profile: Refreshing state... [id=ec2-instance-profile]
aws_route53_record.apse2_wildcard_cert_validation["*.apse2.com"]: Refreshing state... [id=Z09894843QG7J1MO45IQ0__56fe1587127b82a6f67c538939a3fe76.apse2.com._CNAME]
aws_acm_certificate_validation.apse2_wildcard_cert_validation: Refreshing state... [id=2024-01-27 09:27:41.107 +0000 UTC]
aws_internet_gateway.gw: Refreshing state... [id=igw-04d2dae30427425bb]
aws_security_group.all: Refreshing state... [id=sg-022d663f4177b31cd]
aws_subnet.public2: Refreshing state... [id=subnet-0aaf48c52ec90dd1a]
aws_subnet.public1: Refreshing state... [id=subnet-03d02c1913e5a7e17]
aws_lb_target_group.graylog_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/graylog-tg/e5d95599829ece2d]
aws_subnet.private2: Refreshing state... [id=subnet-0c554a1b8323b1de4]
aws_lb_target_group.grafana_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/421165a951a7c27a]
aws_subnet.private1: Refreshing state... [id=subnet-0a892d70c825f21bc]
aws_lb_target_group.wazuh_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/wazuh-tg/f82d94e88c55eb4e]
aws_route_table.public: Refreshing state... [id=rtb-07d5e5349f9e26179]
module.ec2_prometheus.aws_instance.this[0]: Refreshing state... [id=i-0e7de500b79a83df6]
aws_nat_gateway.nat: Refreshing state... [id=nat-087a3050e779ad781]
aws_lb.soc_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:loadbalancer/app/soc-alb/894bb79551ab6cb7]
aws_route_table_association.public1: Refreshing state... [id=rtbassoc-029d604ae22b397e3]
aws_route_table_association.public2: Refreshing state... [id=rtbassoc-090db73de77cde073]
module.ec2_wazuh-indexer-01.aws_instance.this[0]: Refreshing state... [id=i-020ee2d56341b4bd9]
module.ec2_grafana.aws_instance.this[0]: Refreshing state... [id=i-08bd6045feda93592]
aws_route_table.private: Refreshing state... [id=rtb-0ac24f37859269d8f]
aws_lb_target_group_attachment.graylog_attachment: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/graylog-tg/e5d95599829ece2d-20240128041646644900000001]
aws_route_table_association.private1: Refreshing state... [id=rtbassoc-01b8de58aaedb4470]
aws_route_table_association.private2: Refreshing state... [id=rtbassoc-02605b946f56d70ea]
aws_route53_record.graylog_record: Refreshing state... [id=Z09894843QG7J1MO45IQ0_graylog.apse2.com_A]
aws_route53_record.grafana_record: Refreshing state... [id=Z09894843QG7J1MO45IQ0_grafana.apse2.com_A]
aws_route53_record.prometheus_record: Refreshing state... [id=Z09894843QG7J1MO45IQ0_prometheus.apse2.com_A]
aws_lb_listener.https_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:listener/app/soc-alb/894bb79551ab6cb7/26f8209db44195b5]
aws_route53_record.wazuh_record: Refreshing state... [id=Z09894843QG7J1MO45IQ0_wazuh.apse2.com_A]
aws_lb_listener_rule.graylog_subdomain: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:listener-rule/app/soc-alb/894bb79551ab6cb7/26f8209db44195b5/fdad23ec653ef252]
aws_lb_listener_rule.grafana_subdomain: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:listener-rule/app/soc-alb/894bb79551ab6cb7/26f8209db44195b5/74594ec4917e91c4]
aws_lb_listener_rule.wazuh_subdomain: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:listener-rule/app/soc-alb/894bb79551ab6cb7/26f8209db44195b5/964322617c2f1803]
aws_volume_attachment.ebs_att_prometheus: Refreshing state... [id=vai-3835864464]
aws_volume_attachment.ebs_att_wazuh-indexer-01: Refreshing state... [id=vai-2087835945]
aws_lb_target_group_attachment.wazuh_attachment: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/wazuh-tg/f82d94e88c55eb4e-20240127050235591300000001]
aws_volume_attachment.ebs_att_grafana: Refreshing state... [id=vai-465159468]
aws_lb_target_group_attachment.grafana_attachment: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/421165a951a7c27a-20240127110741764600000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ebs_volume.gp3_volume_graylog will be created
  + resource "aws_ebs_volume" "gp3_volume_graylog" {
      + arn               = (known after apply)
      + availability_zone = "us-east-1a"
      + encrypted         = (known after apply)
      + final_snapshot    = false
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 100
      + snapshot_id       = (known after apply)
      + tags_all          = (known after apply)
      + throughput        = (known after apply)
      + type              = "gp3"
    }

  # aws_lb_target_group.graylog_tg will be updated in-place
  ~ resource "aws_lb_target_group" "graylog_tg" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/graylog-tg/e5d95599829ece2d"
        name                               = "graylog-tg"
        tags                               = {}
        # (16 unchanged attributes hidden)

      ~ health_check {
          ~ interval            = 5 -> 30
          ~ protocol            = "HTTPS" -> "HTTP"
          ~ timeout             = 2 -> 5
            # (6 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lb_target_group_attachment.graylog_attachment must be replaced
-/+ resource "aws_lb_target_group_attachment" "graylog_attachment" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/graylog-tg/e5d95599829ece2d-20240128041646644900000001" -> (known after apply)
      ~ target_id        = "i-020ee2d56341b4bd9" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_volume_attachment.ebs_att_graylog will be created
  + resource "aws_volume_attachment" "ebs_att_graylog" {
      + device_name  = "/dev/sdh"
      + force_detach = true
      + id           = (known after apply)
      + instance_id  = (known after apply)
      + volume_id    = (known after apply)
    }

  # module.ec2_grafana.aws_instance.this[0] will be updated in-place
  ~ resource "aws_instance" "this" {
        id                                   = "i-08bd6045feda93592"
      ~ instance_type                        = "t2.small" -> "t3.small"
        tags                                 = {
            "Environment" = "prod"
            "Name"        = "Grafana"
            "Terraform"   = "true"
        }
        # (30 unchanged attributes hidden)

        # (10 unchanged blocks hidden)
    }

  # module.ec2_graylog.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0a3c3a20c09d6f377"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "ec2-instance-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0a892d70c825f21bc"
      + tags                                 = {
          + "Environment" = "prod"
          + "Name"        = "graylog"
          + "Terraform"   = "true"
        }
      + tags_all                             = {
          + "Environment" = "prod"
          + "Name"        = "graylog"
          + "Terraform"   = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "graylog"
        }
      + vpc_security_group_ids               = [
          + "sg-022d663f4177b31cd",
        ]

      + credit_specification {}

      + enclave_options {
          + enabled = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + timeouts {}
    }

  # module.ec2_prometheus.aws_instance.this[0] will be updated in-place
  ~ resource "aws_instance" "this" {
        id                                   = "i-0e7de500b79a83df6"
      ~ instance_type                        = "t2.small" -> "t3.small"
        tags                                 = {
            "Environment" = "prod"
            "Name"        = "Prometheus"
            "Terraform"   = "true"
        }
        # (30 unchanged attributes hidden)

        # (10 unchanged blocks hidden)
    }

Plan: 4 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```